#### Terraform Initialization `success`
#### Terraform Plan `success`
#### Pusher: renovate[bot], Action: `pull_request`

<details><summary>Show Plan</summary>

```text
terraform
data.sakuracloud_archive.ubuntu_archive: Reading...
sakuracloud_ssh_key_gen.gen_key: Refreshing state... [id=113602090971]
sakuracloud_internet.k8s_external_switch: Refreshing state... [id=113602090969]
sakuracloud_disk.k8s_rook_disk[4]: Refreshing state... [id=113602090985]
sakuracloud_disk.k8s_rook_disk[7]: Refreshing state... [id=113602090980]
sakuracloud_disk.k8s_rook_disk[1]: Refreshing state... [id=113602090981]
sakuracloud_switch.k8s_internal_switch: Refreshing state... [id=113602090970]
sakuracloud_disk.k8s_rook_disk[6]: Refreshing state... [id=113602090987]
sakuracloud_disk.k8s_rook_disk[3]: Refreshing state... [id=113602090975]
sakuracloud_disk.k8s_rook_disk[2]: Refreshing state... [id=113602090979]
sakuracloud_disk.k8s_rook_disk[5]: Refreshing state... [id=113602090986]
data.sakuracloud_archive.ubuntu_archive: Read complete after 1s [id=113601947038]
sakuracloud_disk.k8s_rook_disk[0]: Refreshing state... [id=113602090988]
sakuracloud_disk.k8s_control_plane_disk[2]: Refreshing state... [id=113602090993]
sakuracloud_disk.k8s_control_plane_disk[0]: Refreshing state... [id=113602090991]
sakuracloud_disk.k8s_control_plane_disk[1]: Refreshing state... [id=113602090990]
sakuracloud_disk.k8s_worker_node_disk[5]: Refreshing state... [id=113602090977]
sakuracloud_disk.k8s_worker_node_disk[3]: Refreshing state... [id=113602090973]
sakuracloud_disk.k8s_worker_node_disk[1]: Refreshing state... [id=113602090974]
sakuracloud_disk.k8s_worker_node_disk[2]: Refreshing state... [id=113602090978]
sakuracloud_disk.k8s_worker_node_disk[4]: Refreshing state... [id=113602090976]
sakuracloud_disk.k8s_worker_node_disk[6]: Refreshing state... [id=113602090984]
sakuracloud_disk.k8s_worker_node_disk[7]: Refreshing state... [id=113602090983]
sakuracloud_disk.k8s_worker_node_disk[0]: Refreshing state... [id=113602090989]
sakuracloud_vpc_router.k8s_internal_router: Refreshing state... [id=113602090992]
sakuracloud_server.k8s_control_plane[1]: Refreshing state... [id=113602091042]
sakuracloud_server.k8s_control_plane[2]: Refreshing state... [id=113602091022]
sakuracloud_server.k8s_control_plane[0]: Refreshing state... [id=113602091037]
sakuracloud_server.k8s_worker_node[5]: Refreshing state... [id=113602091010]
sakuracloud_server.k8s_worker_node[1]: Refreshing state... [id=113602091007]
sakuracloud_server.k8s_worker_node[4]: Refreshing state... [id=113602091008]
sakuracloud_server.k8s_worker_node[7]: Refreshing state... [id=113602091020]
sakuracloud_server.k8s_worker_node[3]: Refreshing state... [id=113602091018]
sakuracloud_server.k8s_worker_node[6]: Refreshing state... [id=113602091006]
sakuracloud_server.k8s_worker_node[0]: Refreshing state... [id=113602091009]
sakuracloud_server.k8s_worker_node[2]: Refreshing state... [id=113602091011]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # sakuracloud_disk.k8s_control_plane_disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                   = "113602090991" -> (known after apply)
        name                 = "k8s-dev-control-plane-1"
      ~ server_id            = "113602091037" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_control_plane_disk[1] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                   = "113602090990" -> (known after apply)
        name                 = "k8s-dev-control-plane-2"
      ~ server_id            = "113602091042" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_control_plane_disk[2] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                   = "113602090993" -> (known after apply)
        name                 = "k8s-dev-control-plane-3"
      ~ server_id            = "113602091022" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113602090989" -> (known after apply)
        name                 = "k8s-dev-worker-node-1"
      ~ server_id            = "113602091009" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[1] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113602090974" -> (known after apply)
        name                 = "k8s-dev-worker-node-2"
      ~ server_id            = "113602091007" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[2] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113602090978" -> (known after apply)
        name                 = "k8s-dev-worker-node-3"
      ~ server_id            = "113602091011" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[3] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113602090973" -> (known after apply)
        name                 = "k8s-dev-worker-node-4"
      ~ server_id            = "113602091018" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[4] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113602090976" -> (known after apply)
        name                 = "k8s-dev-worker-node-5"
      ~ server_id            = "113602091008" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[5] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113602090977" -> (known after apply)
        name                 = "k8s-dev-worker-node-6"
      ~ server_id            = "113602091010" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[6] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113602090984" -> (known after apply)
        name                 = "k8s-dev-worker-node-7"
      ~ server_id            = "113602091006" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[7] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113602090983" -> (known after apply)
        name                 = "k8s-dev-worker-node-8"
      ~ server_id            = "113602091020" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_server.k8s_control_plane[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_control_plane" {
      ~ disks             = [
          - "113602090991",
        ] -> (known after apply)
        id                = "113602091037"
        name              = "k8s-dev-control-plane-1"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_control_plane[1] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_control_plane" {
      ~ disks             = [
          - "113602090990",
        ] -> (known after apply)
        id                = "113602091042"
        name              = "k8s-dev-control-plane-2"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_control_plane[2] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_control_plane" {
      ~ disks             = [
          - "113602090993",
        ] -> (known after apply)
        id                = "113602091022"
        name              = "k8s-dev-control-plane-3"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113602090989",
          - "113602090988",
        ] -> (known after apply)
        id                = "113602091009"
        name              = "k8s-dev-worker-node-1"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[1] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113602090974",
          - "113602090981",
        ] -> (known after apply)
        id                = "113602091007"
        name              = "k8s-dev-worker-node-2"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[2] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113602090978",
          - "113602090979",
        ] -> (known after apply)
        id                = "113602091011"
        name              = "k8s-dev-worker-node-3"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[3] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113602090973",
          - "113602090975",
        ] -> (known after apply)
        id                = "113602091018"
        name              = "k8s-dev-worker-node-4"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[4] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113602090976",
          - "113602090985",
        ] -> (known after apply)
        id                = "113602091008"
        name              = "k8s-dev-worker-node-5"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[5] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113602090977",
          - "113602090986",
        ] -> (known after apply)
        id                = "113602091010"
        name              = "k8s-dev-worker-node-6"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[6] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113602090984",
          - "113602090987",
        ] -> (known after apply)
        id                = "113602091006"
        name              = "k8s-dev-worker-node-7"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[7] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113602090983",
          - "113602090980",
        ] -> (known after apply)
        id                = "113602091020"
        name              = "k8s-dev-worker-node-8"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 11 to add, 11 to change, 11 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>